tests/fixtures/read_inventory_v04_response.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Body>
    <ns2:readAllAMDResV04 xmlns:ns2="http://main.jws.com.hanel.de">
      <ns2:return>
        <article xmlns="http://main.jws.com.hanel.de/xsd">
          <articleNumber>1001</articleNumber>
          <articleName>Bolt M6</articleName>
          <batchNumber>LOT-2024</batchNumber>
          <liftNumber>1</liftNumber>
          <shelfNumber>5</shelfNumber>
          <compartmentNumber>12</compartmentNumber>
          <compartmentDepthNumber>3</compartmentDepthNumber>
          <containerSize>1</containerSize>
          <fifo>0</fifo>
          <inventoryAtStorageLocation>250</inventoryAtStorageLocation>
          <minimumInventory>50</minimumInventory>
          <h10SpecialField>8032611721991</h10SpecialField>
        </article>
        <article xmlns="http://main.jws.com.hanel.de/xsd">
          <articleNumber>1002</articleNumber>
          <articleName>Washer 10mm</articleName>
          <liftNumber>0</liftNumber>
          <shelfNumber>0</shelfNumber>
          <compartmentNumber>0</compartmentNumber>
          <compartmentDepthNumber>0</compartmentDepthNumber>
          <containerSize>2</containerSize>
          <fifo>1</fifo>
          <inventoryAtStorageLocation>0</inventoryAtStorageLocation>
          <minimumInventory>10</minimumInventory>
          <h10SpecialField></h10SpecialField>
        </article>
      </ns2:return>
    </ns2:readAllAMDResV04>
  </soapenv:Body>
</soapenv:Envelope>
